ekawahyu/MSP430Ware/driverlib/MSP430FR57xx/mpu.c
        param.seg1boundary = seg1boundary;
        param.seg2boundary = seg2boundary;
        param.seg1accmask = seg1accmask;
        param.seg2accmask = seg2accmask;
        param.seg3accmask = seg3accmask;
        MPU_initThreeSegments(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes MPU with three memory segments
//!
//! This function creates three memory segments in FRAM allowing the user to
//! set access right to each segment. To set the correct value for
//! seg1boundary, the user must consult the Device Family User's Guide and
//! provide the MPUSBx value corresponding to the memory address where the user
//! wants to create the partition. Consult the "Segment Border Setting" section
//! in the User's Guide to find the options available for MPUSBx.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param param is the pointer to struct for initializing three segments.
//!
//! Modified bits of \b MPUSAM register, bits of \b MPUSEG register and bits of
//! \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_initThreeSegments(uint16_t baseAddress,
                           MPU_initThreeSegmentsParam *param)
{
        // Verify access right mask for segment1 is a valid selection
        assert((param->seg1accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
               (param->seg1accmask == (MPU_EXEC | MPU_READ)) ||
               (param->seg1accmask == (MPU_READ | MPU_WRITE)) ||
               (param->seg1accmask == (MPU_READ)) ||
               (param->seg1accmask == (MPU_NO_READ_WRITE_EXEC)));

        // Verify access right mask for segment2 is a valid selection
        assert((param->seg2accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
               (param->seg2accmask == (MPU_EXEC | MPU_READ)) ||
               (param->seg2accmask == (MPU_READ | MPU_WRITE)) ||
               (param->seg2accmask == (MPU_READ)) ||
               (param->seg2accmask == (MPU_NO_READ_WRITE_EXEC)));

        // Verify access right mask for segment3 is a valid selection
        assert((param->seg3accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
               (param->seg3accmask == (MPU_EXEC | MPU_READ)) ||
               (param->seg3accmask == (MPU_READ | MPU_WRITE)) ||
               (param->seg3accmask == (MPU_READ)) ||
               (param->seg3accmask == (MPU_NO_READ_WRITE_EXEC)));

        // Verify segment1 boundary is valid selection
        assert(param->seg1boundary < MPU_MAX_SEG_VALUE);

        // Write MPU password to allow MPU register configuration
        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW | HWREG8(baseAddress + OFS_MPUCTL0);

        // Create two memory segmentations
        HWREG16(baseAddress + OFS_MPUSEG) = ((param->seg2boundary) << 8) + param->seg1boundary;

        // Set access rights based on user's selection for segment1
        switch (param->seg1accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG1WE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1XE + MPUSEG1RE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG1XE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1RE + MPUSEG1WE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG1XE + MPUSEG1WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG1RE;
                break;
        case MPU_EXEC | MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEG1XE + MPUSEG1WE + MPUSEG1RE);
                break;
        case MPU_NO_READ_WRITE_EXEC:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG1XE + MPUSEG1WE + MPUSEG1RE);
                break;
        default:
                break;
        }

        // Set access rights based on user's selection for segment2
        switch (param->seg2accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG2WE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG2XE + MPUSEG2RE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG2XE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG2RE + MPUSEG2WE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG2XE + MPUSEG2WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG2RE;
                break;
        case MPU_EXEC | MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEG2XE + MPUSEG2WE + MPUSEG2RE);
                break;
        case MPU_NO_READ_WRITE_EXEC:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG2XE + MPUSEG2WE + MPUSEG2RE);
                break;
        default:
                break;
        }

        // Set access rights based on user's selection for segment3
        switch (param->seg3accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG3WE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3XE + MPUSEG3RE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEG3XE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3RE + MPUSEG3WE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG3XE + MPUSEG3WE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEG3RE;
                break;
        case MPU_EXEC | MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEG3XE + MPUSEG3WE + MPUSEG3WE);
                break;
        case MPU_NO_READ_WRITE_EXEC:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEG3XE + MPUSEG3WE + MPUSEG3WE);
                break;
        default:
                break;
        }

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Initializes user information memory segment
//!
//! This function initializes user information memory segment with specified
//! access rights.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param accmask is the bit mask of access right for user information memory
//!        segment.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_READ - Read rights
//!        - \b MPU_WRITE - Write rights
//!        - \b MPU_EXEC - Execute rights
//!        - \b MPU_NO_READ_WRITE_EXEC - no read/write/execute rights
//!
//! Modified bits of \b MPUSAM register and bits of \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_initInfoSegment(uint16_t baseAddress, uint8_t accmask)
{
        // Verify access right mask for segment1 is a valid selection
        assert(((accmask == (MPU_EXEC | MPU_READ | MPU_WRITE)) ||
                (accmask == (MPU_EXEC | MPU_READ)) ||
                (accmask == (MPU_READ | MPU_WRITE)) ||
                (accmask == (MPU_READ)) ||
                (accmask == (MPU_NO_READ_WRITE_EXEC))));

