ekawahyu/MSP430Ware/driverlib/MSP430FR57xx/mpu.c
        // Write MPU password to allow MPU register configuration
        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW | HWREG8(baseAddress + OFS_MPUCTL0);

        // Set access rights based on user's selection for segment1
        switch (accmask) {
        case MPU_EXEC | MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEGIWE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEGIXE + MPUSEGIRE;
                break;
        case MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~MPUSEGIXE;
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEGIRE + MPUSEGIWE;
                break;
        case MPU_READ:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEGIXE + MPUSEGIWE);
                HWREG16(baseAddress + OFS_MPUSAM) |= MPUSEGIRE;
                break;
        case MPU_EXEC | MPU_READ | MPU_WRITE:
                HWREG16(baseAddress + OFS_MPUSAM) |= (MPUSEGIXE + MPUSEGIWE + MPUSEGIRE);
                break;
        case MPU_NO_READ_WRITE_EXEC:
                HWREG16(baseAddress + OFS_MPUSAM) &= ~(MPUSEGIXE + MPUSEGIWE + MPUSEGIRE);
                break;
        default:
                break;
        }

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
} //*****************************************************************************
//
//! \brief The following function enables the MPU module in the device.
//!
//! This function needs to be called once all memory segmentation has been
//! done. If this function is not called the MPU module will not be activated.
//!
//! \param baseAddress is the base address of the MPU module.
//!
//! Modified bits of \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_start(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW | MPUENA | HWREG8(baseAddress + OFS_MPUCTL0);

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief The following function enables PUC generation when an access
//! violation has Occurred on the memory segment selected by the user.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param segment is the bit mask of memory segment that will generate a PUC
//!        when an access violation occurs.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_FIRST_SEG - PUC generation on first memory segment
//!        - \b MPU_SECOND_SEG - PUC generation on second memory segment
//!        - \b MPU_THIRD_SEG - PUC generation on third memory segment
//!        - \b MPU_INFO_SEG - PUC generation on user information memory
//!           segment
//!
//! Modified bits of \b MPUSAM register and bits of \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_enablePUCOnViolation(uint16_t baseAddress,
                              uint16_t segment
                              )
{
        // Verify user has selected a valid memory segment
        assert(0x00 != (segment & (MPU_FIRST_SEG + MPU_SECOND_SEG + MPU_THIRD_SEG)));

        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW | HWREG8(baseAddress + OFS_MPUCTL0);
        HWREG16(baseAddress + OFS_MPUSAM) |= segment;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief The following function disables PUC generation when an access
//! violation has Occurred on the memory segment selected by the user.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param segment is the bit mask of memory segment that will NOT generate a
//!        PUC when an access violation occurs.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_FIRST_SEG - PUC generation on first memory segment
//!        - \b MPU_SECOND_SEG - PUC generation on second memory segment
//!        - \b MPU_THIRD_SEG - PUC generation on third memory segment
//!        - \b MPU_INFO_SEG - PUC generation on user information memory
//!           segment
//!
//! Modified bits of \b MPUSAM register and bits of \b MPUCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void MPU_disablePUCOnViolation(uint16_t baseAddress,
                               uint16_t segment
                               )
{
        // Verify user has selected a valid memory segment
        assert(0x00 != (segment & (MPU_FIRST_SEG + MPU_SECOND_SEG + MPU_THIRD_SEG)));

        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW | HWREG8(baseAddress + OFS_MPUCTL0);
        HWREG16(baseAddress + OFS_MPUSAM) &= ~segment;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Returns the memory segment violation flag status requested by the
//! user.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param memAccFlag is the is the memory access violation flag.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_SEG_1_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 1 is detected
//!        - \b MPU_SEG_2_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 2 is detected
//!        - \b MPU_SEG_3_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 3 is detected
//!        - \b MPU_SEG_INFO_ACCESS_VIOLATION - is set if an access violation
//!           in User Information Memory Segment is detected
//!
//! \return Logical OR of any of the following:
//!         - \b MPU_SEG_1_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 1 is detected
//!         - \b MPU_SEG_2_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 2 is detected
//!         - \b MPU_SEG_3_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 3 is detected
//!         - \b MPU_SEG_INFO_ACCESS_VIOLATION is set if an access violation in
//!         User Information Memory Segment is detected
//!         \n indicating the status of the masked flags.
//
//*****************************************************************************
uint16_t MPU_getInterruptStatus(uint16_t baseAddress,
                                uint16_t memAccFlag
                                )
{
        return HWREG16(baseAddress + OFS_MPUCTL1) & memAccFlag;
}

//*****************************************************************************
//
//! \brief Clears the masked interrupt flags
//!
//! Returns the memory segment violation flag status requested by the user or
//! if user is providing a bit mask value, the function will return a value
//! indicating if all flags were cleared.
//!
//! \param baseAddress is the base address of the MPU module.
//! \param memAccFlag is the is the memory access violation flag.
//!        Mask value is the logical OR of any of the following:
//!        - \b MPU_SEG_1_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 1 is detected
//!        - \b MPU_SEG_2_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 2 is detected
//!        - \b MPU_SEG_3_ACCESS_VIOLATION - is set if an access violation in
//!           Main Memory Segment 3 is detected
//!        - \b MPU_SEG_INFO_ACCESS_VIOLATION - is set if an access violation
//!           in User Information Memory Segment is detected
//!
//! \return Logical OR of any of the following:
//!         - \b MPU_SEG_1_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 1 is detected
//!         - \b MPU_SEG_2_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 2 is detected
//!         - \b MPU_SEG_3_ACCESS_VIOLATION is set if an access violation in
//!         Main Memory Segment 3 is detected
//!         - \b MPU_SEG_INFO_ACCESS_VIOLATION is set if an access violation in
//!         User Information Memory Segment is detected
//!         \n indicating the status of the masked flags.
//
//*****************************************************************************
uint16_t MPU_clearInterruptFlag(uint16_t baseAddress,
                                uint16_t memAccFlag
                                )
{

        HWREG16(baseAddress + OFS_MPUCTL0) = MPUPW | HWREG8(baseAddress + OFS_MPUCTL0);
        HWREG16(baseAddress + OFS_MPUCTL1) &= ~memAccFlag;

        //Lock MPU to disable writing to all registers
        HWREG8(baseAddress + OFS_MPUCTL0_H) = 0x00;

